In [69]:
import pandas as pd

# read_csv

In [10]:
df = pd.read_csv('data/friend_list.csv')

In [11]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [19]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter = '\t')

In [20]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [30]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [31]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager

In [32]:
df.columns = ['name', 'age', 'job']

In [34]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [35]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [36]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

# Create DF

## from dictionary

In [37]:
friend_dict_list = [
    {'name' : 'John', 'age' : 20, 'job' : 'student'},
    {'name' : 'Jenny', 'age' : 30, 'job' : 'developer'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}    
]

In [39]:
df = pd.DataFrame(friend_dict_list)

In [43]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [44]:
df = df[['name', 'age', 'job']]

In [45]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## from OrderedDict

In [46]:
from collections import OrderedDict

In [48]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate']),
                                  ('age', [20, 30, 30]),
                                  ('job', ['student', 'developer', 'teacher'])])
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [49]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## from list

### 1.

In [50]:
friend_list = [
    ['John',20,'student'],
    ['Jenny',30,'developer'],
    ['Nate',30,'teacher']
]
column_name = ['name','age','job']

In [51]:
df = pd.DataFrame(friend_list)

In [52]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

X

In [57]:
df = pd.DataFrame.from_records(friend_list, column_name)

In [56]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

X

In [58]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [59]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

O

### 2.

In [60]:
friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]

In [63]:
df = pd.DataFrame(friend_list)
df

      0                              1
0  name            [John, Jenny, Nate]
1   age                   [20, 30, 30]
2   job  [student, developer, teacher]

X

In [68]:
df = pd.DataFrame.from_items(friend_list)
df

/Users/shinchan-yeop/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

O

# Write DF to file

In [100]:
friend_list = [ 
                ['name',['John', None, 'nate']],
                ['age',[20,None,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

/Users/shinchan-yeop/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [101]:
df

   name   age        job
0  John  20.0    student
1  None   NaN  developer
2  nate  30.0    teacher

In [102]:
df.to_csv('friend_list_from_df.csv')

In [103]:
df.to_csv('friend_list_from_df.csv', header = False, index = False)

In [104]:
df.to_csv('friend_list_from_df.csv', header = ['name','age','job'])

In [106]:
df.to_csv('friend_list_from_df.csv', na_rep = '-')

# select row

## by index

In [108]:
friend_list = [
    ['name',['Jone','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

/Users/shinchan-yeop/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [109]:
df.head()

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [110]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [111]:
df.loc[[0,2]]

   name  age      job
0  Jone   20  student
2  Nate   30  teacher

## by column condition

In [114]:
df_filtered = df[df.age > 25]

In [115]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [116]:
df_filtered = df.query('age>25')

In [117]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [118]:
df_filtered = df[(df.age > 25) & (df.name == 'Nate')]

In [119]:
df_filtered

   name  age      job
2  Nate   30  teacher

# Filter Column

## by index

In [121]:
friend_list = [['John',20,'student'],['Jenny',30,'developer'],['Nate',30,'teacher']]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [133]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [134]:
df.iloc[:,[0,2]]

       0          2
0   John    student
1  Jenny  developer
2   Nate    teacher

## by column name

In [137]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name','age','job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [140]:
df_filtered = df[['name','age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [143]:
df.filter(items=['name','age'])

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [146]:
df.filter(like = 'a', axis = 1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [147]:
df.filter(regex = 'b$', axis = 1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern